//创建一个5行5列的整形数组, 依次赋值0~24, 完成行列元素转置的操作(即a[i][j] = a[j][i])
#include <stdio.h>

int main()
{
	int a[5][5];  //定义一个5行5列的整形数组
	int i = 0, j = 0;  //i为行计数值,j为列计数值
	int t;        //t为a[i][j]与a[j][i],交换值的中间变量

	for (i = 0; i < 5; i++)   //数组元素从0开始计数,如果这里设置i=1;i<=5;i++ 会读到a[5]未定义的元素,造成段错误的bug
	{
		for (j = 0; j < 5; j++)
		{
			a[i][j] = i * 5 + j;
		}                     //赋值操作
	}

	for (i = 0; i < 5; i++)   //嵌套循环,完成值交换操作,t为中间变量
	{
		for (j = i; j < 5; j++)   //以数组的对角线为边界进行数组转置操作
		{
			t = a[i][j];
			a[i][j] = a[j][i];
			a[j][i] = t;
		}
	}
	for (i = 0; i < 5; i++)   //操作行
	{
		for (j = 0; j < 5; j++) //操作列
		{
			printf("%3d ", a[i][j]); //%3d留出三个字符的长度,字符从右往左输出
		}
		printf("\n");
	}

	return 0;
}
